Tekla Open API Reference for Tekla Structures 2025
AnalysisDesignParameterBase.IsGeneral Property
 Gets or sets a value indicating whether the design parameter is general.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsGeneral { get; set; }
Public Property IsGeneral As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
AnalysisDesignParameterBase Class
Tekla.Structures.Analysis Namespace